KCX-Mapping-Convert/testdaten/EMCS-V20/UidsFromKids/EMCSExportRejection.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true"><To>DE01.CSFALT.2144</To><From>DE01.CSFALT.2144</From><MessageID>EI20100519</MessageID><SentAt>2011-08-19 12:02:00 +0200</SentAt><Act>request</Act><Method>EMCS</Method><MessageVersion>2.0</MessageVersion><MessageType>EMCSRejectionOfEAADForExport</MessageType></Header></soap:Header><soap:Body><Submit xmlns="http://www.eurtradenet.com/schemas/uids/emcs/body/200911"><EMCS><EMCSRejectionOfEAADForExport><DateAndTimeOfIssuance>2010-06-01T00:00:00+0200</DateAndTimeOfIssuance><ExportCrossCheckingDiagnoses><LocalReferenceNumber>ReferenceNumber</LocalReferenceNumber><DocumentReferenceNumber>DocumentReferenceNumber</DocumentReferenceNumber><CancelExportFlag>CancelExport</CancelExportFlag><Diagnosis><AadReferenceCode>AadReferenceCode1</AadReferenceCode><BodyRecordUniqueReference>ItemNumber1</BodyRecordUniqueReference><DiagnosisCode>DiagnosisCode1</DiagnosisCode></Diagnosis><Diagnosis><AadReferenceCode>AadReferenceCode2</AadReferenceCode><BodyRecordUniqueReference>ItemNumber2</BodyRecordUniqueReference><DiagnosisCode>DiagnosisCode2</DiagnosisCode></Diagnosis></ExportCrossCheckingDiagnoses><Rejection><RejectionDateAndTime>2010-05-19T14:55:00+0200</RejectionDateAndTime><RejectionReasonCode>RejectionReasonCode</RejectionReasonCode></Rejection><CAadVal><AadReferenceCode>AadReferenceCode</AadReferenceCode><SequenceNumber>SequenceNumber</SequenceNumber></CAadVal><CAadVal><AadReferenceCode>21</AadReferenceCode><SequenceNumber>22</SequenceNumber></CAadVal><ConsigneeTrader><CustomerID>CustomerID-Consignee</CustomerID><VATID>VATID-Consignee</VATID><Address><Name>Name-Consignee</Name><Street>StreetAndNumber-Consignee</Street><PostalCode>PostalCode-Consignee</PostalCode><City>City-Consignee</City><Language>CE</Language></Address></ConsigneeTrader></EMCSRejectionOfEAADForExport></EMCS></Submit></soap:Body></soap:Envelope>
